doc/slides/slide_constructeur.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Constructeur &amp; Destructeur de classe</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Constructeur &amp; Destructeur de classe</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Le constructeur et le destructeur sont deux <b>méthodes <i>i.e.</i> fonctions
membres</b> particulières

<ul class="org-ul">
<li>le constructeur est appelé à la création d&rsquo;un objet,
</li>
<li>le destructeur est appelé à la destruction d&rsquo;un objet.
</li>
</ul>
</li>

<li>constructeur &equiv; <b>initialisation des membres</b> (gestion de l&rsquo;allocation
dynamique de mémoire)
</li>

<li>destructeur &equiv; <b>ultimes opérations</b> (désallocation de la mémoire
précédemment allouée)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Constructeur de classe</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Le constructeur est une méthode à part entière (d&rsquo;où la possibilité de la
surdéfinir) à ceci près que

<ul class="org-ul">
<li>le constructeur doit porter <b>le même nom</b> que la classe,
</li>

<li>le constructeur ne doit avoir <b>aucun type</b> de retour.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Déclaration de constructeurs</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
<span class="org-keyword">public</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur par d&#233;faut</span>
  <span class="org-function-name">particule</span> ();

  <span class="org-comment-delimiter">// </span><span class="org-comment">Surd&#233;finition de constructeur</span>
  <span class="org-function-name">particule</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>);

<span class="org-keyword">private</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Définition de constructeurs</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"particule.h"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Initialisation des membres &#224; une valeur par d&#233;faut</span>
<span class="org-constant">particule</span>::<span class="org-function-name">particule</span> ()
  : m_masse (0.0), m_charge (0.0)
{
}

<span class="org-constant">particule</span>::<span class="org-function-name">particule</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>)
  : m_masse (masse_), m_charge (charge_)
{
}
...
particule my_particule1; <span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur par d&#233;faut</span>
<span class="org-type">particule</span> <span class="org-function-name">my_particule2</span> (0.511, 1.6e-19);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Destructeur de classe</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Le destructeur est également une méthode à ceci près que

<ul class="org-ul">
<li>le destructeur doit porter <b>le même nom</b> que la classe <b>préfixé du signe
<code>~</code></b>,
</li>

<li>le destructeur <b>ne possède pas d&rsquo;argument</b>; il n&rsquo;est donc pas possible de
surdéfinir cette méthode.
</li>
</ul>
</li>

<li>Lors d&rsquo;allocation dynamique de mémoire, la présence d&rsquo;un destructeur est
obligatoire<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Déclaration de destructeur</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-keyword">public</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur par d&#233;faut</span>
  <span class="org-function-name">particule</span> ();

  <span class="org-comment-delimiter">// </span><span class="org-comment">Destructeur</span>
  ~<span class="org-function-name">particule</span> ();

  <span class="org-keyword">private</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de membres</span>
  <span class="org-type">char</span> * <span class="org-variable-name">m_nom</span>;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Définition de destructeur</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"particule.h"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Initialisation</span>
<span class="org-constant">particule</span>::<span class="org-function-name">particule</span> ()
  : m_nom (<span class="org-keyword">new</span> <span class="org-type">char</span>[256])
{
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Destruction</span>
<span class="org-constant">particule</span>::~<span class="org-function-name">particule</span> ()
{
  <span class="org-keyword">delete</span>[] m_nom;
}
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes"> </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
c&rsquo;est également le cas pour l&rsquo;héritage
</p></div>


</div>
</div></div>
</body>
</html>
